"Button 1:"		= "Button 1:";
"Button 2:"		= "Button 2:";
"Button 3:" 	= "Button 3:";
"Button 4:"		= "Button 4:";

"Backlight Correction"	= "תיקון תאורת רקע";
"Color Restoration"		= "שחזור צבע";
"Descreening"			= "תיקון סריקה";
"Dust Removal"			= "הסרת לכלוך";
"Unsharp Mask"			= "מסכת חידוד";

"None"			= "ללא";
"Newspaper"		= "עיתון (lpi ‏85)";
"Magazine"		= "מגזין (lpi ‏133)";
"Fine Prints"	= "אותיות קטנות (‎175 lpi)";
"General"		= "כללי";

"Low"		= "נמוך";
"Medium"	= "בינוני";
"High"		= "גבוה";

"Quiet Mode"        = "מצב שקט:";
"Off"               = "כבוי";
"On"                = "פועל";
"Printer Setting"   = "הגדרת מדפסת";
